InformationRegisters/НастройкиМедицинскогоУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиМедицинскогоУчета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдалитьОсновнойШаблонОсмотра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныHTML</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВрачПоУмолчаниюСтационара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойВидМедКарт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыМедицинскихКарт</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойПрейскурант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Прейскуранты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойЦветСвободногоКойкоМеста</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойЦветПациентВСтационаре</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоИнтерваловВКолонкеДня</Name>
					<Comment>Стационар</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысотаСтрокиЖурналаЗаписи</Name>
					<Comment>Стационар</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециализацииГинекологии</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьЛабораторныеИсследования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользуетсяРасширеннаяВнутренняяЛаборатория</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользуетсяИнтеграцияСВнешнимиЛабораториями</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛабораторияПоПостоплатеПрименяется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Helix_ИспользуетсяИнтеграцияСHelix</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПакетСоставныхФразРеакцииНаАллергены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПакетыСоставныхФраз</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправлятьРезультатыВнешнихЛабораторийПоЭлектроннойПочте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправлятьПриемыВАрхивеСПаролем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭлектроннаяПочтаДляРассылки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Invitro_ИспользуетсяИнтеграцияСInvitro</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использоватьwkhtmltopdf</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Адресwkhtmltopdf</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьВакцинации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВакцинацииСоздаютЛистыОжидания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьВК</Name>
					<Comment>Для функциональной опции</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УпрощеннаяЛабораторияИспользуется</Name>
					<Comment>Допускается упрощенное указание забора без лаборатории и с кодом пробы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьЕГИСЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СитиЛаб_ИспользуетсяИнтеграцияССитиЛаб</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяВыпискиДляБронированияПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КДЛ_ИспользуетсяИнтеграцияСКДЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РабочийРежимОбменаСФСС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьККонвертеруPDFAGhostScript</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресФедеральногоСервисаГИП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресФедеральногоСервисаРЭМД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СертификатФССТестовый</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СертификатФССРабочий</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Гемотест_ИспользуетсяИнтеграцияСГемотест</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтключитьКонтрольСертификатовФСС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьЛистыНетрудоспособности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПостоплатаПоПриемамИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьЭлектронныеПодписиЭМК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтладочныйРежимРаботыЕГИСЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранитьФайлыЭМДВоВнешнемАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьКАрхивуЭМД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стационар_ПериодичностьАвтообновленияАРМПалатной</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьКАрхивуИзображений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтикеткаВнутреннейЛаборатории</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныЭтикетокИЦенниковБПО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СертификатыМОДоступныВсемПользователям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ПолФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПолФизическихЛиц</Name>
			<Comment>Пол физических лиц</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеУказан</Name>
					<Comment>Пол не указан</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
					<Comment>Пол мужской</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
					<Comment>Пол женский</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РасчетФакторовРиска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>РасчетФакторовРиска</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервыйТриместр</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВторойТриместр</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаТретийТриместр</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HTMLПредставление</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФакторыРиска</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФакторРиска</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФакторыРиска</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Баллы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервыйТриместр</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВторойТриместр</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТретийТриместр</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уровень</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/МедицинскаяДеятельностьКОРП/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьДокументыФактораРиска(Клиент) Экспорт
	Если Клиент.Пол = Перечисления.ПолФизическихЛиц.Женский Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	РасчетФакторовРиска.Ссылка
		               |ИЗ
		               |	Документ.РасчетФакторовРиска КАК РасчетФакторовРиска
		               |ГДЕ
		               |	РасчетФакторовРиска.Клиент = &Клиент
		               |	И НЕ РасчетФакторовРиска.ПометкаУдаления
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	РасчетФакторовРиска.Дата";
		Запрос.УстановитьПараметр("Клиент",Клиент);
		Таблица = Запрос.Выполнить().Выгрузить();
		Если Таблица.Количество() <> 0 Тогда
			СписокЗначений = Новый СписокЗначений;
			Для Каждого стр ИЗ Таблица Цикл
				СписокЗначений.Добавить(стр.Ссылка);	
			КонецЦикла;
			Возврат СписокЗначений;
		КонецЕсли;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Функция ПроизвестиОтборМассиваФакторовРиска(СписокЗначений, ДатаНачала , ДатаОкончания , Врач , Специализация ) Экспорт
	СписокЗначенийСОтбором = Новый СписокЗначений;
	СписокЗначенийСОтбором = СписокЗначений.Скопировать();
	
	Если Не Специализация.Пустая() Тогда 
		Специализации = МедицинскаяДеятельностьКОРП.ПолучитьПараметрМедДеятельности("СпециализацииГинекологии").Получить();
		Рез = Специализации.Найти(Специализация);
		Если Рез = Неопределено Тогда
			СписокЗначенийСОтбором.Очистить();
			Возврат СписокЗначенийСОтбором;	
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого стр Из СписокЗначенийСОтбором Цикл
		
		Если ЗначениеЗаполнено(ДатаНачала) Тогда
			Если стр.Значение.Дата < ДатаНачала Тогда
				СписокЗначенийСОтбором.Удалить(стр);
				Продолжить;	
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДатаОкончания) Тогда
			Если стр.Значение.Дата > ДатаОкончания Тогда
				СписокЗначенийСОтбором.Удалить(стр);
				Продолжить;	
			КонецЕсли;
		КонецЕсли;

		Если Не Врач.Пустая() Тогда
			Если стр.Значение.Врач1 <> Врач И стр.Значение.Врач2 <> Врач И стр.Значение.Врач3 <> Врач Тогда
				СписокЗначенийСОтбором.Удалить(стр);
				Продолжить;	
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;
	
	Возврат СписокЗначенийСОтбором;
	
КонецФункции

Функция ПолучитьHTMLПредставлениеДокумента(Документ) Экспорт
	Возврат Документ.HTMLПредставление.Получить();	
КонецФункции

// Возвращает структуру значений 
//
// Параметры:
//	Дата - не используется 
//
// Возвращаемое значение:
//  Структура с параметрами учетной политики
//
Функция ПолучитьНастройкиМедДеятельности(Дата=Неопределено)   Экспорт 
	
	нзПарамМедУчета = РегистрыСведений.НастройкиМедицинскогоУчета.СоздатьНаборЗаписей();
	нзПарамМедУчета.Прочитать();
	
	мПарамМедУчета = Новый Структура;
	
	Если нзПарамМедУчета.Количество()<>0 Тогда
		
		мПарамМедУчета = Новый Структура;
		мМетаданныеРесурсы = Метаданные.РегистрыСведений.НастройкиМедицинскогоУчета.Ресурсы;
		Для Каждого Ресурс Из мМетаданныеРесурсы Цикл
			мПарамМедУчета.Вставить(Ресурс.Имя, нзПарамМедУчета[0][Ресурс.Имя]); 
		КонецЦикла;

	Иначе
		мПарамМедУчета = ПолучитьМедДеятельностьПоУмолчанию();                                         
	КонецЕсли;
	
	Возврат мПарамМедУчета;
	
КонецФункции                                                                                    

// Возвращает значение параметра 
//
// Параметры:
//  ИмяПараметра - имя параметра
//	Дата		 - не используется 
//
// Возвращаемое значение:
//  определяется типом значения параметра
//
Функция ПолучитьПараметрМедДеятельности(ИмяПараметра, Дата=Неопределено)   Экспорт 
	
	Перем Возв;
	
	мПарамМедУчета = РегистрыСведений.НастройкиМедицинскогоУчета.СоздатьНаборЗаписей();
	мПарамМедУчета.Прочитать();
	
	Если мПарамМедУчета.Количество() <> 0 Тогда
		Возврат мПарамМедУчета[0][ИмяПараметра]; 
	Иначе
		Возврат ПолучитьЗначениеПараметраМедДеятельностиПоУмолчанию(ИмяПараметра)
	КонецЕсли;
	
КонецФункции

// Возвращает значение параметра по умолчанию
//
// Параметры:
//  ИмяПараметра - имя параметра
//
// Возвращаемое значение:
//  определяется типом значения параметра
//
Функция ПолучитьЗначениеПараметраМедДеятельностиПоУмолчанию(ИмяПараметра) Экспорт
	                                                                                                
	Если ИмяПараметра = "" Тогда                                                   
	Иначе
		Возврат Метаданные.РегистрыСведений.НастройкиМедицинскогоУчета.Ресурсы[ИмяПараметра].Тип.ПривестиЗначение(Неопределено);
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьПараметрыИзШаблона(Строка) Экспорт
	
	Массив = Новый Массив;
	
	ИмяПарметраПрав = Прав(Строка,СтрДлина(Строка) - Найти(Строка, "[")); 
	ИмяПарметра = Лев(ИмяПарметраПрав, Найти(ИмяПарметраПрав, "]") - 1);
	Массив.Добавить(ИмяПарметра);
	Если Найти(ИмяПарметраПрав,"[") <> 0 Тогда
		Рез = ПолучитьПараметрыИзШаблона(ИмяПарметраПрав);
		Для каждого стр Из Рез Цикл
			Массив.Добавить(стр);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Массив;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает структуру значений по умолчанию
//
// Параметры:
//	Нет
//
// Возвращаемое значение:
//  Структура с параметрами учетной политики
//
Функция ПолучитьМедДеятельностьПоУмолчанию()
	
	мМетаданные	= Метаданные.РегистрыСведений.НастройкиМедицинскогоУчета.Ресурсы;
	СтруктураВозврата = Новый Структура;
	Для Каждого Реквизит из мМетаданные Цикл
		
		СтруктураВозврата.Вставить(Реквизит.Имя, ПолучитьЗначениеПараметраМедДеятельностиПоУмолчанию(Реквизит.Имя));
		
	КонецЦикла;
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти
